[Main]
DisplayName=Suomalainen

[Brower_Protected_M]
btn_ok=Ok
Site_Safe_tip=Tämä sivusto on turvallinen
Site_Risk_tip=Tämä sivusto sisältää mahdollisia uhkia
Protected_Off_tip=Advanced SystemCare selaussuoja: Pois
Site_Safe=Turvallinen:
Site_Risk=Riskialtis:
Site_Advisory=Varoituksen tarjoaa
Site_Details=Lisätietoja
Risk_Title=Tämä sivusto on raportoitu turvattomaksi
Risk_recommend=Suosittelemme, ettet jatka tällä sivustolla.
Risk_goBack=Peruuta
Risk_report=Ilmoita väärä hälytys
Risk_continue=Jatka silti
Site_turbo_tip=Selaus on kytketty pois, koska Opera Turbo on käytössä
ads_Removed=mainokset poistetaan tällä sivulla
ads_Nofound=Ei ilmoitusta löytyi
Site_Miner_tip=Kryptovaluutan louhinta estetty tällä sivulla
Link_Safe_tip=Tämä linkki on turvallinen
Link_Risk_tip=Tämä linkki ei ole turvallinen
Sender_Risk_tip=Tämä lähettäjä on epäilyttävä.
Link_Phish_tip=Tämä linkki sisältää tietojenkalasteluhuijauksen.
Risk_Title_Phish=Tämä verkkosivusto on raportoitu tietojenkalastelusivustoksi.
Site_Risk_link=Tämä sähköposti sisältää haitallisen linkin.
Site_Risk_sender=Tämän sähköpostin lähettäjä on epäilyttävä.
Site_Risk_link_sender=Tämä sähköposti sisältää haitallisen linkin, ja lähettäjä on epäilyttävä.
Site_Risk_phish=Tämä sivusto sisältää tietojenkalasteluhuijauksia.

